app/controllers/songs_controller.rb

SELECT  1 AS one FROM "artists" LIMIT 1
---
  def new
    if params[:artist_id] && !Artist.exists?(params[:artist_id])